{
  "main": {
    "name": "Johnny",
    "occupation": "Full-Stack Developer",
    "description": "software developer with 3 years of experience in fast-paced, deadline-driven environment. Highly experienced in the software development lifecycle. Supportive and enthusiastic team player dedicated to efficiently resolving project issues. Ability and willingness to innovate and learn new technologies, quick learner passionate about development",
    "bio": "Hi! I'm Johnny. I'm currently studying Software Engineering Technology in Centennial College and also currently working in WIMTACH. I love to learn new technologies and create something new. Nowadays, I'm into solving algorithm questoins",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "hyunjongshin.dev@gmail.com",
    "address": {
      "city": "Toronto",
      "state": "Ontario"
    },
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/johnny-shin",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/shinhyunjong8017",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/Johnny-shin",
        "className": "fa fa-github"
      },
      {
        "name": "Something",
        "url": "mailto:hyunjongshin.dev@gmail.com?Subject=Hello%20Hyunjong",
        "className": "fa fa-envelope"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "Centennial College",
        "degree": "Software Engineering Technology",
        "graduated": "Expected Dec 2021",
        "description": "I've learned object-oriented software design methodologies, user-oriented interface design, software testing and QA, C#, Java, Java EE, Oracle, MS-SQL server, UNIX/Linux, Python, Microsoft's ASP.NET Core, HTML5/JavaScript/Angular, mobile application development, emerging web frameworks, cloud computing, data mining and more."
      }
    ],
    "work": [
      {
        "company": "SAP",
        "title": "Full Stack Developer",
        "years": "May 2021 - Present",
        "description": "Develop, test, and maintain applications while effectively communicating with external stakeholders. \nUpdated and streamlined legacy code by upgrading to Spring Framework 5.3 and its dependencies. \nDeveloped RESTful APIs in compliance with industry best practices, leveraging Junit(with Mockito) and Robot frameworks to ensure comprehensive test coverage.\nProvided technical demos to coworkers as part of regular sync meetings.\nAssisted in troubleshooting technical issues for interns and new junior developers.\nCompleted all security training requirements to ensure compliance with company guidelines.",
        "technologies": [
          "Java",
          "Spring Framework",
          "Junit",
          "JavaScript",
          "UI5",
          "HANA",
          "XSA",
          "Docker",
          "Jenkins",
          "Selenium"
        ]
      },
      {
        "company": "WIMTACH X Xello",
        "title": "Front End Developer",
        "years": "May 2021 - Dec 2021",
        "description": "Refactoring AngularJS to Angular for better performance with TypeScript in Agile environment. \nCreating and maintaining 100% coverage unit testing each service and component with Jest in Test-Driven Development \nProviding proof of concept to replace deprecated third party libraries. \nexperiencing with all the phases of SDLC and agile development methodologies including SCRUM, involved in daily SCRUM meetings to keep track of the ongoing project status and issues using JIRA",
        "technologies": ["TypeScript", "Angular", "Jest", "SCSS", "RxJS"]
      },
      {
        "company": "WIMTACH X InterDev",
        "title": "Full Stack Developer",
        "years": "Sep 2020 - May 2021",
        "description": "Led student researchers and demonstrated progress bi-weekly to clients \nProfessional experience in mobile app development using React Native and Redux framework from scratch \nImplemented video and voice call for web(Angular) to mobile and mobile to mobile using WebRTC(peer-to-peer communication) \nDeveloped push notification for IOS and Android utilizing OneSignal which based on firebase in ASP.NET \nManaged quality of React Native as a code owner using Jira,Trello board (Agile tools) and Git (Version Control) ",
        "technologies": [
          "JavaScript",
          "React Native",
          "Redux",
          "ASP.NET",
          "SQL",
          "WebRTC"
        ]
      },
      {
        "company": "Alpha Healthcare",
        "title": "Software Developer",
        "years": "Dec 2019 - May 2020",
        "description": "Refactored ASP.NET code to feature enhancement & performance improvement (20 – 30% faster) \nCreated new feature using google map \nParticipated in restructuring and migrating database for CRM solution (DB Migration /DB Design)",
        "technologies": [
          "C#",
          "Java",
          "ASP.NET",
          "JavaScript",
          "Selenium",
          "SQL"
        ]
      }
    ],
    "skills": [
      {
        "name": "Spring Framework/Boot",
        "level": "90%"
      },
      {
        "name": "React",
        "level": "85%"
      },
      {
        "name": "Angular",
        "level": "80%"
      },
      {
        "name": "ASP.NET",
        "level": "80%"
      },
      {
        "name": "SQL",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Brew4Coffee",
        "category": "This is eCommerce web applicaiton using MERN stack",
        "image": "brew4you.png",
        "url": "https://github.com/Johnny-shin/coffee-shop"
      },
      {
        "title": "Petnerup Hackathon",
        "category": "This is a prototype mobile application for a hackathon contest that won 1st prize",
        "image": "PETNERUP.png",
        "url": "https://www.figma.com/file/eTorwfz7KthevSMGOY1i9v/Petnerup-colors-(Copy)?type=design&node-id=131-6&mode=design&t=OX8ghsuzSWhtwtDD-0"
      },
      {
        "title": "WEB RTC PoC",
        "category": "This is only purpose of demonstration for customer",
        "image": "web-rtc-poc.png",
        "url": "https://github.com/Johnny-shin/demo_webRTC"
      },
      {
        "title": "Firefly",
        "category": "Hackathon Project (Excellence Award)",
        "image": "firefly.jpeg",
        "url": "https://github.com/Johnny-shin/FireFly"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
